namespace SupportAI.ML.Utils;

public static class PersianStopWords
{
    public static readonly HashSet<string> StopWords = new()
{
    "از", "به", "برای", "با", "در", "که", "این", "و", "را", "یا", "اما",
    "اگر", "آن", "همه", "چرا", "چگونه", "کجا", "کی", "هر", "بر", "تا",
    "یک", "ما", "شما", "او", "آنها", "من", "تو", "هیچ", "هم", "چه", "بود",
    "نیست", "شد", "است", "داریم", "دارد", "کنید", "کنم", "کرد", "باشید",
    "باید", "نیز", "همین", "دیگر", "شدن", "شود", "باشد", "کرده", "دارای",
    "داشته", "همچنین", "بنابراین", "ولی", "چنان", "هرگز", "هرچند", "اگرچه",
    "در حالی", "حتی", "اینکه", "آنکه", "چند"
};
}
